In [1]:
import pandas as pd

In [2]:
df = pd.read_csv('Data/stack-overflow-developer-survey-2024/survey_results_public.csv')
schema_df = pd.read_csv('Data/stack-overflow-developer-survey-2024/survey_results_schema.csv')

In [3]:
df.head()

,ResponseId,MainBranch,Age,Employment,RemoteWork,Check,CodingActivities,EdLevel,LearnCode,LearnCodeOnline,...,JobSatPoints_6,JobSatPoints_7,JobSatPoints_8,JobSatPoints_9,JobSatPoints_10,JobSatPoints_11,SurveyLength,SurveyEase,ConvertedCompYearly,JobSat
0,1,I am a developer by profession,Under 18 years old,"Employed, full-time",Remote,Apples,Hobby,Primary/elementary school,Books / Physical media,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1,2,I am a developer by profession,35-44 years old,"Employed, full-time",Remote,Apples,Hobby;Contribute to open-source projects;Other...,"Bachelor’s degree (B.A., B.S., B.Eng., etc.)",Books / Physical media;Colleague;On the job tr...,Technical documentation;Blogs;Books;Written Tu...,...,0.0,0.0,0.0,0.0,0.0,0.0,NaN,NaN,NaN,NaN
2,3,I am a developer by profession,45-54 years old,"Employed, full-time",Remote,Apples,Hobby;Contribute to open-source projects;Other...,"Master’s degree (M.A., M.S., M.Eng., MBA, etc.)",Books / Physical media;Colleague;On the job tr...,Technical documentation;Blogs;Books;Written Tu...,...,NaN,NaN,NaN,NaN,NaN,NaN,Appropriate in length,Easy,NaN,NaN
3,4,I am learning to code,18-24 years old,"Student, full-time",NaN,Apples,NaN,Some college/university study without earning ...,"Other online resources (e.g., videos, blogs, f...",Stack Overflow;How-to videos;Interactive tutorial,...,NaN,NaN,NaN,NaN,NaN,NaN,Too long,Easy,NaN,NaN
4,5,I am a developer by profession,18-24 years old,"Student, full-time",NaN,Apples,NaN,"Secondary school (e.g. American high school, G...","Other online resources (e.g., videos, blogs, f...",Technical documentation;Blogs;Written Tutorial...,...,NaN,NaN,NaN,NaN,NaN,NaN,Too short,Easy,NaN,NaN

In [4]:
schema_df.tail()

,qid,qname,question,force_resp,type,selector
82,QID337,JobSatPoints_7,"Learning and using new technology, including p...",NaN,MC,MAVR
83,QID337,JobSatPoints_8,"Designing and building environments, databases...",NaN,MC,MAVR
84,QID337,JobSatPoints_9,"Being a power user of a tool, developer langua...",NaN,MC,MAVR
85,QID337,JobSatPoints_10,Working with new and/or top-quality hardware,NaN,MC,MAVR
86,QID337,JobSatPoints_11,A well-staffed/sourced internal network that m...,NaN,MC,MAVR

In [5]:
people = {
    "first" : ["Anish", "Ramish", "Samish", "Bamish"],
    "last" : ["Khadka", "Mainali", "Shrestha", "Karki"],
    "email" : ["anishramish56@gmail.com", "mainaliramish89@gmail.com", "shresthasamish28@gmail.com", "bamishkarki819@gmail.com"]
}

In [7]:
people['email']

['anishramish56@gmail.com',
 'mainaliramish89@gmail.com',
 'shresthasamish28@gmail.com',
 'bamishkarki819@gmail.com']

In [8]:
people['first']

['Anish', 'Ramish', 'Samish', 'Bamish']

In [9]:
# A data frame can be modeled with plain python as above, a table of data.
# Let's create a dataframe from this plain python dictionary
mydf = pd.DataFrame(people)
mydf

    first      last                       email
0   Anish    Khadka     anishramish56@gmail.com
1  Ramish   Mainali   mainaliramish89@gmail.com
2  Samish  Shrestha  shresthasamish28@gmail.com
3  Bamish     Karki    bamishkarki819@gmail.com

In [10]:
mydf['email']

0       anishramish56@gmail.com
1     mainaliramish89@gmail.com
2    shresthasamish28@gmail.com
3      bamishkarki819@gmail.com
Name: email, dtype: object

In [12]:
type(mydf['email'])

pandas.core.series.Series

Now, the mydf['email'] is a series type. What is a series? 
A series is a collection of rows of a column. A dataframe is a 2D strutcture with rows and columns, while a series is a colletion of elements in 1D. 

Simplistic view as of now, the idea will evolve as we go deeper into the lesson.

In [13]:
mydf.email # Alternative way of accessing elements.
# Can cause problem if the column name and data frame attribute have same name.

0       anishramish56@gmail.com
1     mainaliramish89@gmail.com
2    shresthasamish28@gmail.com
3      bamishkarki819@gmail.com
Name: email, dtype: object

In [18]:
# Accessing multiple columns, it won't be a series
mydf[['last', 'email']]

       last                       email
0    Khadka     anishramish56@gmail.com
1   Mainali   mainaliramish89@gmail.com
2  Shrestha  shresthasamish28@gmail.com
3     Karki    bamishkarki819@gmail.com

In [20]:
type(mydf[['last', 'email']]) # Just a sliced dataframe, not a series

pandas.core.frame.DataFrame

In [22]:
mydf.columns # List of columns

Index(['first', 'last', 'email'], dtype='object')

In [23]:
# Selecting rows : loc and iloc functions
# iloc : integer location
mydf.iloc[0] # first row

first                      Anish
last                      Khadka
email    anishramish56@gmail.com
Name: 0, dtype: object

In [24]:
mydf.iloc[[0,1]] # Multiple rows, a data frame is returned.

    first     last                      email
0   Anish   Khadka    anishramish56@gmail.com
1  Ramish  Mainali  mainaliramish89@gmail.com

In [26]:
mydf.iloc[[0,1], [1,2]] # Rows and columns

      last                      email
0   Khadka    anishramish56@gmail.com
1  Mainali  mainaliramish89@gmail.com

In [27]:
mydf.loc[0]

first                      Anish
last                      Khadka
email    anishramish56@gmail.com
Name: 0, dtype: object

In [28]:
mydf.loc[[0,1],['last', 'email']] # iloc was about using integer location, now names

      last                      email
0   Khadka    anishramish56@gmail.com
1  Mainali  mainaliramish89@gmail.com

In [29]:
mydf.head()

    first      last                       email
0   Anish    Khadka     anishramish56@gmail.com
1  Ramish   Mainali   mainaliramish89@gmail.com
2  Samish  Shrestha  shresthasamish28@gmail.com
3  Bamish     Karki    bamishkarki819@gmail.com

# Use the knowledge so far to work with real large data from previous lesson

In [31]:
df.columns

Index(['ResponseId', 'MainBranch', 'Age', 'Employment', 'RemoteWork', 'Check',
       'CodingActivities', 'EdLevel', 'LearnCode', 'LearnCodeOnline',
       ...
       'JobSatPoints_6', 'JobSatPoints_7', 'JobSatPoints_8', 'JobSatPoints_9',
       'JobSatPoints_10', 'JobSatPoints_11', 'SurveyLength', 'SurveyEase',
       'ConvertedCompYearly', 'JobSat'],
      dtype='object', length=114)

In [33]:
df['CodingActivities']

0                                                    Hobby
1        Hobby;Contribute to open-source projects;Other...
2        Hobby;Contribute to open-source projects;Other...
3                                                      NaN
4                                                      NaN
                               ...
65432                        Hobby;School or academic work
65433             Hobby;Contribute to open-source projects
65434                                                Hobby
65435    Hobby;Contribute to open-source projects;Profe...
65436                                                  NaN
Name: CodingActivities, Length: 65437, dtype: object

In [34]:
df['CodingActivities'].value_counts()

Hobby                                                                                                                                                                         9993
I don’t code outside of work                                                                                                                                                  6508
Hobby;Professional development or self-paced learning from online courses                                                                                                     6203
Hobby;Contribute to open-source projects                                                                                                                                      3732
Professional development or self-paced learning from online courses                                                                                                           3120
                                                                                                                                                                              ...
Hobby;Other (please specify):;Bootstrapping a business;School or academic work;Professional development or self-paced learning from online courses;Freelance/contract work       1
Hobby;Contribute to open-source projects;Other (please specify):;Bootstrapping a business;School or academic work                                                                1
Other (please specify):;Bootstrapping a business;School or academic work                                                                                                         1
Contribute to open-source projects;Other (please specify):;Bootstrapping a business;Freelance/contract work                                                                      1
Other (please specify):;School or academic work;Freelance/contract work                                                                                                          1
Name: CodingActivities, Length: 118, dtype: int64

In [36]:
df.loc[[0,1,2,3], 'CodingActivities']

0                                                Hobby
1    Hobby;Contribute to open-source projects;Other...
2    Hobby;Contribute to open-source projects;Other...
3                                                  NaN
Name: CodingActivities, dtype: object

In [37]:
# Slicing
df.loc[0:3, 'CodingActivities']

0                                                Hobby
1    Hobby;Contribute to open-source projects;Other...
2    Hobby;Contribute to open-source projects;Other...
3                                                  NaN
Name: CodingActivities, dtype: object

In [38]:
df.loc[0:3, 'Age' :'CodingActivities']

,Age,Employment,RemoteWork,Check,CodingActivities
0,Under 18 years old,"Employed, full-time",Remote,Apples,Hobby
1,35-44 years old,"Employed, full-time",Remote,Apples,Hobby;Contribute to open-source projects;Other...
2,45-54 years old,"Employed, full-time",Remote,Apples,Hobby;Contribute to open-source projects;Other...
3,18-24 years old,"Student, full-time",NaN,Apples,NaN

In [ ]:
# Have been too slow to move forward